benchmarks/results/auth-serialization/test-serialization/test-jsonable_enc/wrk2-logs/run_1_2005_1539.txt
Running 30s test @ http://127.0.0.1:8000/serialization-jsonable-encoder
  2 threads and 6 connections
  Thread calibration: mean lat.: 3944.923ms, rate sampling interval: 14155ms
  Thread calibration: mean lat.: 3997.001ms, rate sampling interval: 14327ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.82s     4.57s   23.84s    57.64%
    Req/Sec    62.50      1.50    64.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.80s 
 75.000%   19.79s 
 90.000%   22.13s 
 99.000%   23.56s 
 99.900%   23.81s 
 99.990%   23.86s 
 99.999%   23.86s 
100.000%   23.86s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7868.415     0.000000            1         1.00
    9494.527     0.100000          253         1.11
   11059.199     0.200000          503         1.25
   12640.255     0.300000          755         1.43
   14213.119     0.400000         1006         1.67
   15802.367     0.500000         1258         2.00
   16621.567     0.550000         1383         2.22
   17448.959     0.600000         1510         2.50
   18235.391     0.650000         1637         2.86
   19005.439     0.700000         1760         3.33
   19791.871     0.750000         1886         4.00
   20185.087     0.775000         1949         4.44
   20578.303     0.800000         2012         5.00
   20971.519     0.825000         2075         5.71
   21364.735     0.850000         2137         6.67
   21757.951     0.875000         2201         8.00
   21954.559     0.887500         2233         8.89
   22134.783     0.900000         2263        10.00
   22347.775     0.912500         2295        11.43
   22544.383     0.925000         2327        13.33
   22724.607     0.937500         2357        16.00
   22839.295     0.943750         2375        17.78
   22937.599     0.950000         2390        20.00
   23035.903     0.956250         2406        22.86
   23134.207     0.962500         2422        26.67
   23232.511     0.968750         2438        32.00
   23281.663     0.971875         2445        35.56
   23330.815     0.975000         2453        40.00
   23379.967     0.978125         2462        45.71
   23429.119     0.981250         2469        53.33
   23478.271     0.984375         2476        64.00
   23494.655     0.985938         2480        71.11
   23527.423     0.987500         2485        80.00
   23543.807     0.989062         2487        91.43
   23576.575     0.990625         2493       106.67
   23609.343     0.992188         2496       128.00
   23642.111     0.992969         2498       142.22
   23658.495     0.993750         2499       160.00
   23674.879     0.994531         2501       182.86
   23707.647     0.995313         2503       213.33
   23724.031     0.996094         2505       256.00
   23756.799     0.996484         2507       284.44
   23756.799     0.996875         2507       320.00
   23773.183     0.997266         2508       365.71
   23789.567     0.997656         2510       426.67
   23789.567     0.998047         2510       512.00
   23789.567     0.998242         2510       568.89
   23805.951     0.998437         2511       640.00
   23805.951     0.998633         2511       731.43
   23822.335     0.998828         2512       853.33
   23822.335     0.999023         2512      1024.00
   23822.335     0.999121         2512      1137.78
   23838.719     0.999219         2513      1280.00
   23838.719     0.999316         2513      1462.86
   23838.719     0.999414         2513      1706.67
   23838.719     0.999512         2513      2048.00
   23838.719     0.999561         2513      2275.56
   23855.103     0.999609         2514      2560.00
   23855.103     1.000000         2514          inf
#[Mean    =    15817.703, StdDeviation   =     4572.818]
#[Max     =    23838.720, Total count    =         2514]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3776 requests in 30.01s, 198.09MB read
Requests/sec:    125.81
Transfer/sec:      6.60MB